# 6. Задание: Проверка числа на кратность 7

x = int(input("Введите число: "))

if x % 7 == 0:
    print("Число кратно 7")
else:
    print("Число не кратно 7")